OpenFOAM/installationsWithAdditionalTools/openfoam-org/5.x_CFDEM/testCases/enzu_test/CFD.base/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
87615
(
0.2369999
0.23690098
0.2369071
0.23768641
0.23841915
0.23798249
0.23660549
0.23466239
...
)
;

boundaryField
{
    WALL
    {
        type            zeroGradient;
    }
    cyclic_in
    {
        type            cyclic;
    }
    cyclic_out
    {
        type            cyclic;
    }
}


// ************************************************************************* //
